using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace YW.Model
{
    public enum DeviceModel
    {
        //八位二进制来描述是否带手表特殊功能，来区分设备类型。5个预留位，加上拍照、真人头像、防脱落报警
        YW000 = 0, //00000000 
        YW001 = 1, //00000001 此设备带有防脱落报警功能
        YW010 = 2, //00000010 此设备带有真人头像功能
        YW011 = 3, //00000011 此设备带有真人头像和防脱落报警功能
        YW100 = 4, //00000100 此设备带有拍照功能
        YW101 = 5, //00000101 此设备带有拍照功能和防脱落报警功能
        YW110 = 6, //00000110 此设备带有拍照功能和真人头像功能
        YW111 = 7  //00000111 此设备带有拍照、真人头像和防脱落报警功能
    }
}
